#encoding:utf-8
STRUCT_CONTENT_AI = """\
	Tsc_1:str_AI; //Температура силового цилиндра 1
	Tsc_2:str_AI; //Температура силового цилиндра 2
	Tsc_3:str_AI; //Температура силового цилиндра 3
	Tsc_4:str_AI; //Температура силового цилиндра 4
	Tsc_5:str_AI; //Температура силового цилиндра 5
	Tsc_6:str_AI; //Температура силового цилиндра 6
	Tsc_7:str_AI; //Температура силового цилиндра 7
	Tsc_8:str_AI; //Температура силового цилиндра 8
	Tsc_9:str_AI; //Температура силового цилиндра 9
	Tsc_10:str_AI; //Температура силового цилиндра 10
	Tvg_lk:str_AI; //Температура выхлопных газов в левом коллекторе
	Tvg_pk:str_AI; //Температура выхлопных газов в правом коллекторе
	Reserv_0:str_AI; //Резерв
	Reserv_1:str_AI; //Резерв
	Reserv_2:str_AI; //Резерв
	Reserv_3:str_AI; //Резерв
	Tkp_1:str_AI; //Температура коренного подшипника № 1
	Tkp_2:str_AI; //Температура коренного подшипника № 2
	Tkp_3:str_AI; //Температура коренного подшипника № 3
	Tkp_4:str_AI; //Температура коренного подшипника № 4
	Tkp_5:str_AI; //Температура коренного подшипника № 5
	Tkp_6:str_AI; //Температура коренного подшипника № 6
	Tkp_7:str_AI; //Температура коренного подшипника № 7
	Tkp_8:str_AI; //Температура коренного подшипника № 8
	Tkp_9:str_AI; //Температура коренного подшипника № 9
	Tkp_10:str_AI; //Температура коренного подшипника № 10
	Tv_inD:str_AI; //Температура воды на входе в двигатель
	Tv_outD:str_AI; //Температура воды на выходе из двигателя
	Tvn:str_AI; //Температура воздуха наддува
	Tm_inGMK:str_AI; //Температура масла на входе в ГМК
	Tm_outGMK:str_AI; //Температура масла на выходе из ГМК
	Reserv_4:str_AI; //Резерв
	Tg_outKC_1:str_AI; //Температура газа на выходе компрессорного цилиндра 1
	Tg_outKC_2:str_AI; //Температура газа на выходе компрессорного цилиндра 2
	Tg_outKC_3:str_AI; //Температура газа на выходе компрессорного цилиндра 3
	Tg_outKC_4:str_AI; //Температура газа на выходе компрессорного цилиндра 4
	Tg_outKC_5:str_AI; //Температура газа на выходе компрессорного цилиндра 5
	Reserv_5:str_AI; //Резерв
	Reserv_6:str_AI; //Резерв
	Reserv_7:str_AI; //Резерв
	Reserv_8:str_AI; //Резерв
	Reserv_9:str_AI; //Резерв
	RegKr1_KCU:str_AI; //Управление запорно-регулирующим клапаном на приёме ГМК PV4601.1. КЦУ
	U_Osn_AC:str_AI; //Напряжение основного питания ~220 В
	U_Res_AC:str_AI; //Напряжение резервного питания ~220 В
	Pg_inGMK:str_AI; //Давление газа на входе в ГМК
	Pg_outGMK:str_AI; //Давление газа на выходе из ГМК
	Ppv:str_AI; //Давление пускового воздуха
	Ptg_inTRK:str_AI; //Давление топливного газа до ТРК
	Ptg_outTRK:str_AI; //Давление топливного газа после ТРК
	Pvn:str_AI; //Давление воздуха наддува
	Pm_inTK:str_AI; //Давление масла на входе в турбокомпрессоры
	Pm_inD:str_AI; //Давление масла на входе в двигатель
	dPmf:str_AI; //Перепад давления масла на фильтре
	Pv_outD:str_AI; //Давление воды на выходе из двигателя
	Pos_TRK:str_AI; //Положение ТРК PV9604.1
	Pos_RegKr1:str_AI; //Положение запорно-регулирующего клапана на приёме ГМК PV4601.1
	Vb_Ch_1:str_AI; //Уровень вибрации ГМК (виброскорость), канал 1
	Vb_Ch_2:str_AI; //Уровень вибрации ГМК (виброскорость), канал 2
	Reserv_10:str_AI; //Резерв
	Reserv_11:str_AI; //Резерв
"""
